
**<h1><span style="color:red"><u>Credit score calculations</u></span></h1>**
**Datascientest**

### <span style="color:yellow"> 0. Importation des librairies</span>

In [100]:
import pandas as pd

## <span style="color:red"> I. Audit des données</span>

In [164]:
df = pd.read_csv(filepath_or_buffer = 'test.csv',
                           sep = ',',
                           header = 0)

#print(df.columns)
print(df.head())

       ID Customer_ID      Month             Name  Age          SSN  \
0  0x160a   CUS_0xd40  September    Aaron Maashoh   23  821-00-0265
1  0x160b   CUS_0xd40    October    Aaron Maashoh   24  821-00-0265
2  0x160c   CUS_0xd40   November    Aaron Maashoh   24  821-00-0265
3  0x160d   CUS_0xd40   December    Aaron Maashoh  24_  821-00-0265
4  0x1616  CUS_0x21b1  September  Rick Rothackerj   28  004-07-5839

  Occupation Annual_Income  Monthly_Inhand_Salary  Num_Bank_Accounts  ...  \
0  Scientist      19114.12            1824.843333                  3  ...
1  Scientist      19114.12            1824.843333                  3  ...
2  Scientist      19114.12            1824.843333                  3  ...
3  Scientist      19114.12                    NaN                  3  ...
4    _______      34847.84            3037.986667                  2  ...

   Num_Credit_Inquiries  Credit_Mix Outstanding_Debt Credit_Utilization_Ratio  \
0                2022.0        Good           809.98                35.030402
1                   4.0        Good           809.98                33.053114
2                   4.0        Good           809.98                33.811894
3                   4.0        Good           809.98                32.430559
4                   5.0        Good           605.03                25.926822

       Credit_History_Age Payment_of_Min_Amount Total_EMI_per_month  \
0   22 Years and 9 Months                    No           49.574949
1  22 Years and 10 Months                    No           49.574949
2                     NaN                    No           49.574949
3   23 Years and 0 Months                    No           49.574949
4   27 Years and 3 Months                    No           18.816215

   Amount_invested_monthly                 Payment_Behaviour  \
0       236.64268203272135    Low_spent_Small_value_payments
1       21.465380264657146  High_spent_Medium_value_payments
2       148.23393788500925   Low_spent_Medium_value_payments
3        39.08251089460281  High_spent_Medium_value_payments
4       39.684018417945296   High_spent_Large_value_payments

      Monthly_Balance
0  186.26670208571772
1  361.44400385378196
2  264.67544623342997
3  343.82687322383634
4   485.2984336755923

[5 rows x 27 columns]

In [102]:
df.isna().sum()

ID                             0
Customer_ID                    0
Month                          0
Name                        5015
Age                            0
SSN                            0
Occupation                     0
Annual_Income                  0
Monthly_Inhand_Salary       7498
Num_Bank_Accounts              0
Num_Credit_Card                0
Interest_Rate                  0
Num_of_Loan                    0
Type_of_Loan                5704
Delay_from_due_date            0
Num_of_Delayed_Payment      3498
Changed_Credit_Limit           0
Num_Credit_Inquiries        1035
Credit_Mix                     0
Outstanding_Debt               0
Credit_Utilization_Ratio       0
Credit_History_Age          4470
Payment_of_Min_Amount          0
Total_EMI_per_month            0
Amount_invested_monthly     2271
Payment_Behaviour              0
Monthly_Balance              562
dtype: int64

In [103]:
df.shape

(50000, 27)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 27 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   ID                        50000 non-null  object
 1   Customer_ID               50000 non-null  object
 2   Month                     50000 non-null  object
 3   Name                      44985 non-null  object
 4   Age                       50000 non-null  object
 5   SSN                       50000 non-null  object
 6   Occupation                50000 non-null  object
 7   Annual_Income             50000 non-null  object
 8   Monthly_Inhand_Salary     42502 non-null  float64
 9   Num_Bank_Accounts         50000 non-null  int64
 10  Num_Credit_Card           50000 non-null  int64
 11  Interest_Rate             50000 non-null  int64
 12  Num_of_Loan               50000 non-null  object
 13  Type_of_Loan              44296 non-null  object
 14  Delay_from_due_date       50000 non-null  int64
 15  Num_of_Delayed_Payment    46502 non-null  object
 16  Changed_Credit_Limit      50000 non-null  object
 17  Num_Credit_Inquiries      48965 non-null  float64
 18  Credit_Mix                50000 non-null  object
 19  Outstanding_Debt          50000 non-null  object
 20  Credit_Utilization_Ratio  50000 non-null  float64
 21  Credit_History_Age        45530 non-null  object
 22  Payment_of_Min_Amount     50000 non-null  object
 23  Total_EMI_per_month       50000 non-null  float64
 24  Amount_invested_monthly   47729 non-null  object
 25  Payment_Behaviour         50000 non-null  object
 26  Monthly_Balance           49438 non-null  object
dtypes: float64(4), int64(4), object(19)
memory usage: 10.3+ MB

In [165]:
df.isnull().sum()

ID                             0
Customer_ID                    0
Month                          0
Name                        5015
Age                            0
SSN                            0
Occupation                     0
Annual_Income                  0
Monthly_Inhand_Salary       7498
Num_Bank_Accounts              0
Num_Credit_Card                0
Interest_Rate                  0
Num_of_Loan                    0
Type_of_Loan                5704
Delay_from_due_date            0
Num_of_Delayed_Payment      3498
Changed_Credit_Limit           0
Num_Credit_Inquiries        1035
Credit_Mix                     0
Outstanding_Debt               0
Credit_Utilization_Ratio       0
Credit_History_Age          4470
Payment_of_Min_Amount          0
Total_EMI_per_month            0
Amount_invested_monthly     2271
Payment_Behaviour              0
Monthly_Balance              562
dtype: int64

In [28]:
df.describe()

,Monthly_Inhand_Salary,Num_Bank_Accounts,Num_Credit_Card,Interest_Rate,Delay_from_due_date,Num_Credit_Inquiries,Credit_Utilization_Ratio,Total_EMI_per_month
count,42502.000000,50000.000000,50000.000000,50000.000000,50000.000000,48965.000000,50000.000000,50000.000000
mean,4182.004291,16.838260,22.921480,68.772640,21.052640,30.080200,32.279581,1491.304305
std,3174.109304,116.396848,129.314804,451.602363,14.860397,196.984121,5.106238,8595.647887
min,303.645417,-1.000000,0.000000,1.000000,-5.000000,0.000000,20.509652,0.000000
25%,1625.188333,3.000000,4.000000,8.000000,10.000000,4.000000,28.061040,32.222388
50%,3086.305000,6.000000,5.000000,13.000000,18.000000,7.000000,32.280390,74.733349
75%,5934.189094,7.000000,7.000000,20.000000,28.000000,10.000000,36.468591,176.157491
max,15204.633333,1798.000000,1499.000000,5799.000000,67.000000,2593.000000,48.540663,82398.000000

In [166]:
print(df.duplicated().sum()) # On repère les lignes contenant des doublons

0

In [167]:
df = df.dropna(axis = 0, how = 'any') # On supprime toutes les lignes contenant au moins une valeur manquante

In [108]:
df.isna().sum(axis = 0) #les colonnes de transactions ne contiennent plus de valeurs manquantes

ID                          0
Customer_ID                 0
Month                       0
Name                        0
Age                         0
SSN                         0
Occupation                  0
Annual_Income               0
Monthly_Inhand_Salary       0
Num_Bank_Accounts           0
Num_Credit_Card             0
Interest_Rate               0
Num_of_Loan                 0
Type_of_Loan                0
Delay_from_due_date         0
Num_of_Delayed_Payment      0
Changed_Credit_Limit        0
Num_Credit_Inquiries        0
Credit_Mix                  0
Outstanding_Debt            0
Credit_Utilization_Ratio    0
Credit_History_Age          0
Payment_of_Min_Amount       0
Total_EMI_per_month         0
Amount_invested_monthly     0
Payment_Behaviour           0
Monthly_Balance             0
dtype: int64

In [168]:
len(df['ID'].unique())#ok

26459

In [169]:
len(df['Customer_ID'].unique()) #nok? ok?

10767

In [170]:
df['Month'].unique()#ok

array(['September', 'October', 'December', 'November'], dtype=object)

In [171]:
df['Name'] #ok

0          Aaron Maashoh
1          Aaron Maashoh
4        Rick Rothackerj
5        Rick Rothackerj
7        Rick Rothackerj
              ...
49992     Sarah McBridec
49993     Sarah McBridec
49994     Sarah McBridec
49997              Nicks
49999              Nicks
Name: Name, Length: 26459, dtype: object

In [172]:
#df['Age'].unique() # nok a traité
df["Age"] = df["Age"].apply(lambda x: x.replace("_", ""))
df["Age"] = df["Age"].astype(int)
df = df[(df['Age'] > 0) & (df['Age']<110)]  
df['Age']

0        23
1        24
4        28
5        28
7        28
         ..
49992    29
49993    29
49994    29
49997    25
49999    25
Name: Age, Length: 25663, dtype: int32

In [173]:
#df['SSN'] #nok '#F%$D@*&8', ...,
df=df.loc[df["SSN"].str.match("[0-9][0-9][0-9]\-[0-9][0-9]\-[0-9][0-9][0-9][0-9]")]
df['SSN']

0        821-00-0265
1        821-00-0265
4        004-07-5839
7        004-07-5839
9        486-85-3974
            ...
49992    031-35-0942
49993    031-35-0942
49994    031-35-0942
49997    078-73-5990
49999    078-73-5990
Name: SSN, Length: 24195, dtype: object

In [174]:
#df['Occupation'].unique() #nok  "________" maybe put 'secret'
df = df[df["Occupation"] != "_______"]
df['Occupation']

0           Scientist
1           Scientist
7             Teacher
9            Engineer
12       Entrepreneur
             ...
49991          Writer
49992       Architect
49993       Architect
49997        Mechanic
49999        Mechanic
Name: Occupation, Length: 22496, dtype: object

In [175]:
df['Annual_Income'] = df['Annual_Income'].apply(lambda x: x.replace("_", ""))
df["Annual_Income"] = df["Annual_Income"].astype(float) #nok ? dtype: object, should be Float
df['Annual_Income']

0         19114.12
1         19114.12
7         34847.84
9        143162.64
12        30689.89
           ...
49991     37188.10
49992     20002.88
49993     20002.88
49997     39628.99
49999     39628.99
Name: Annual_Income, Length: 22496, dtype: float64

In [176]:
df['Monthly_Inhand_Salary'] #ok Float

0         1824.843333
1         1824.843333
7         3037.986667
9        12187.220000
12        2612.490833
             ...
49991     3097.008333
49992     1929.906667
49993     1929.906667
49997     3359.415833
49999     3359.415833
Name: Monthly_Inhand_Salary, Length: 22496, dtype: float64

In [177]:
df['Num_Bank_Accounts'].unique() #ok, Integer

array([   3,    2,    1,    0,    8,    5,    6,    7,  936,    9,   10,
          4,  845, 1444,  142,  736,  521, 1005,  368,  420,  500,  579,
       1193,  125, 1619, 1667, 1507,  661, 1124,  250, 1190, 1520, 1709,
         76, 1686, 1691,  382,  185,  333, 1025,  275, 1088, 1266,  216,
         57, 1285, 1102, 1153,  218,  565, 1316,  968, 1101,  393, 1022,
       1305,  766,  954,  417,  150,  600, 1527,  312, 1371,  495, 1556,
        826, 1038,  329, 1220,  415,  168, 1402, 1361,  566,   64,  881,
        590, 1585, 1000,  615, 1068,  717,   21,  182, 1491, 1115, 1218,
        670, 1603,  665,  879, 1518, 1447,  900,  239, 1502,   -1,  326,
        656,   53,  915,  616,  637,  703, 1721,  511,  137, 1204,  640,
       1661,   11, 1135,  209,  552,  865, 1551,  803,   54,  413, 1694,
       1618, 1150, 1011, 1087,  188, 1139,  119,  589, 1717,   96, 1246,
        983,  681,  580, 1382,  837,  620, 1774, 1642, 1578,  184, 1268,
         51, 1532, 1572,  405,  888, 1659,  404,  781, 1606,  911,   74,
       1028,  367, 1570, 1711, 1232, 1020,  909, 1117, 1567, 1441, 1328,
        474,  302,   63, 1488,  429,   71,  950, 1276,  130,  345,   79,
       1327, 1783,  827,  685,  477, 1250,  940, 1295,  928, 1719,  308,
       1372, 1318,  252,  711, 1592, 1334,  274, 1435, 1462,  780, 1563,
       1471,  114,   23,  568,  956, 1406, 1134, 1259, 1292,  365,  466,
        769, 1773,  219,   95, 1473, 1492,  204, 1037,  714, 1293, 1750,
        988,  829,  932, 1493, 1106,   41, 1258,  910, 1194, 1692,  258,
         94, 1364, 1149,  789,  456, 1633,   70,  399,  515, 1111,  201,
       1341,  190, 1256, 1099, 1623,   99, 1057, 1157,  540, 1326,  394,
        880,   90, 1657, 1335,  322, 1211, 1431,  433, 1395,  997,  422,
        800, 1366, 1396,  499, 1540, 1061,  278, 1727], dtype=int64)

In [178]:
df['Num_Credit_Card'].unique() #nok valeurs = 0, Integer
#Un numéro de carte de crédit nul est en général surement une erreur bien
#qu’ici étant donné les autres numéros il pourrait bien être voulu

array([   4,    5,    1,    7,    6,    8,    3,  211,  182,    9,   10,
        914,    2,   11, 1365, 1289,  497,  181,  517, 1084,  488,  784,
       1279, 1036,  510, 1171,  590, 1197,  881,  167, 1427,  766,  513,
        808,  863,  570, 1301, 1184, 1037,  617,  547,  591, 1274, 1465,
        954,   64, 1217,  238, 1499, 1266, 1485, 1168,  330, 1052, 1250,
       1096,  101,  569,  885, 1435,  546,   85,  298,  258,  533,   51,
          0,  217,  886,  408,  720,  751,  524, 1348,  574,  393, 1462,
        712,  476, 1127,  609, 1278, 1323,  433, 1356,   19,  584,  455,
        750,  839,   54, 1392,  757, 1245,  144,  702,  324,   59,  293,
        968,  697,  335,  725,  541,   26,  931, 1393,   30,  322,  338,
        204, 1220, 1242,  856,  121,  366,  168, 1495, 1210,  349,  332,
        555,  299,   69, 1015,  199,  487,   41,  883,   98,   81, 1045,
        974,  770,  174,  829,  384,  118, 1303, 1093, 1312, 1329,  957,
        877,  243,  820,  195,  724,  926, 1070,  982,  232, 1183,  237,
       1080,  660,  721, 1020, 1315,  992,  158,   31,  849,  715, 1498,
        404,  793,  460, 1150,  979,  392, 1156,  231, 1058,  355,  362,
        434,  683,  910,  176,  135,  285,  631,  147, 1405, 1261,  675,
        834,  267, 1488,  897,  789,  964,  650,  868,  778,  733, 1013,
        516,  911, 1055,  203,  367,  878,  644,  788,  142,  792, 1143,
        288, 1263,  256,  970, 1332,  802,  889, 1447,  477,  225,  400,
        273, 1359,  302, 1201,  333,  781, 1034,  595,  760, 1133,  728,
       1066, 1436, 1461,  480, 1208,  316,  128,  192,  448, 1298,  684,
        620, 1445,  907,   75, 1240,  415,  577,  997,  681,  540, 1448,
        966,   79,  922,  818, 1389,  797,  796, 1474, 1253, 1063, 1308,
       1446,  571,  704,   96, 1190, 1071,   49, 1016,  677, 1238,  632,
        116,  638,  170,  879, 1159,  457,  398, 1258,  732,  708,  614,
       1402,  122,  521, 1167,  314,  465, 1132,  790,  265, 1109, 1022,
       1287,  665,  127,  166,   47,  816, 1374,  429, 1411, 1148,  531,
        506,  255, 1032,  310,   37, 1384, 1438,  178,  468, 1180, 1095,
        864, 1255,  528, 1089,  827,  519,  185, 1033,  904,  115,  871,
       1243,  655,  402,  719,  451,  626,  381,  832, 1431, 1188,  304,
        420,  711,  726, 1221,  514,   95,  664,  807,   77,  222,  114,
         18,  769, 1281, 1223, 1026,  950,  350,  247, 1399, 1422,   22,
       1101, 1352, 1186, 1466,  544,  903, 1275, 1244,  657,  164,  347,
        671,  599, 1151, 1386,  654,  835,  777, 1041, 1219,  771,  763,
        858, 1347, 1481, 1321,  873,  100, 1372, 1241,  813,  431,  529,
         73,  251,  523, 1129,  105,  729,  739,  718,  920,  745,  413,
        586,  986,  716,  618,  198,  197,  860,  515,  924,  406,  843,
        257,  592,  689,  900, 1234, 1414,  481,  426,   87,  163,  230,
        692,  952, 1345, 1319, 1380,  598, 1351,  542,   66,  688, 1233,
       1398,  615,  417,   99,  466, 1439,  955], dtype=int64)

In [179]:
df['Interest_Rate'].unique()  #ok, Integer

array([   3,    6,    8,    4,   15,    7,   12,   20,    1,   14, 3097,
         17,   10,   31,   25,   18,   19,    9,   24,   32,    5, 4224,
         33,   11,   16,   21,   29, 5104,   28,   30, 1616,   23,   34,
         27,    2,   13,   26, 1072, 1830,  810,   22, 5031, 2716, 4384,
       4801, 3281, 1503, 2682, 4563, 2228, 1925, 3252,  144, 3154, 2241,
       1295,  436, 4116, 2705, 2183, 4916, 3467,   88, 2239,  953, 4251,
       4895, 3701, 4623, 3561, 1047, 1363, 5476,  985, 1481, 2679, 4137,
       3249, 2126, 1475, 2317, 4507, 1392, 4718, 1504, 1128, 1826, 3388,
       1136, 1447, 1191,  371, 5237, 2108, 2333, 1209, 4271, 4930, 3747,
       5458,  964, 2375, 1187, 2486,  643, 3153, 1048, 4668, 4038,  115,
       4878, 3851, 5541,  400,  303,  545, 3646, 5194, 5502, 2426, 2857,
       3866,  992,  103,  488, 1457,  832, 2184, 1735, 1895, 3972, 5054,
        307, 4536, 5129, 2290, 4387, 3169, 5584, 5725, 1672, 5569, 3651,
       2668,  187,  843, 3675,  923, 4402, 2127,  739, 3609, 5214, 5627,
       3402, 1587, 5077, 2157, 3150, 3921,  125, 1414, 5551, 4935, 4924,
       1425, 2106, 3267, 4737,  247, 5137, 5662, 2139, 5307, 3279, 1166,
       4345, 3977,  234, 4914, 3631,  823, 2953, 1540, 1831,  673,  976,
       1083,  423, 4515, 4391,  998, 2298, 3211, 1960, 5480, 5197, 4522,
       1175, 3022, 3998, 2222, 3234, 5490, 5539, 5192,  817, 5304,  273,
       2318,  462, 1033, 1586, 5408, 4403, 5003, 1228, 1966, 2914,  139,
       2667, 4356, 1398, 3748, 1472, 3936, 4768, 3231,   89, 4266,  496,
       1644, 1164, 5747, 2811, 5640, 1582, 4645, 5637, 5574,  365, 4872,
       5147, 2299, 3377, 1247, 1323, 2517,  850, 5510, 1417, 2664, 2501,
       3981,  113, 1308, 3719, 4873,   59, 3111, 5042, 3938, 5523, 1888,
       2607, 3487, 5531, 1297, 1085,  813, 2922, 2489, 5759, 4576, 1651,
       2801, 3120, 4135,  840, 1415, 2854, 3394, 5515, 3213, 1922, 3222,
       2462, 3040, 2358, 1319, 1833, 3168, 5713, 5180, 2719, 2725,  485,
       4854, 2041, 2326,  520, 4024, 5152, 1399, 3605, 4217, 5656, 3577,
       3193, 2016,  718, 3016, 5011,  828,  782, 2384, 4868, 5682, 3810,
       2452, 3624, 4969, 2561, 2425, 5578,  483, 5060, 4026,  143,  408,
       2796,  516, 2978, 3107, 4609, 2410, 2623, 3417, 3250,  409, 5421,
       5513, 5748, 4159, 3511, 1682, 2644, 4907, 1342, 3805, 2911,  413,
       4790,  648, 2088, 3860, 4003, 3585, 2208, 1851, 3867, 4398, 4297,
       1122, 4094, 1685, 5191, 3527, 1372, 3004, 1203,  209, 1993, 3710,
       5272, 3877, 1163, 3601, 5256,  767, 1838, 4082, 1543, 2708, 3280,
       2980, 4917, 3448, 4478, 1971, 3285, 5678, 1731,  633, 4359, 2674,
       5391, 3961, 2390, 2419,  527, 1023, 5552, 3505, 5543, 2344, 4378,
       5435, 2516, 3059, 1138, 2930, 1706, 5096,  374, 2221, 4595, 2483,
       1670,  504,  569,  691, 4509, 1951, 4673, 2931, 1098,  565, 1962,
       1906,  508,  454, 2695, 1635, 3947, 3130, 2110, 3515, 3653, 5406,
       4671, 4360, 1656, 3941, 1694,  924,  110,  226, 1196, 5121, 1149,
       3072, 3399, 3522, 3466,  900,  447, 1877,  239, 5670, 1931, 5261,
       2658, 4252], dtype=int64)

In [180]:
df['Num_of_Loan'] = df['Num_of_Loan'].apply(lambda x: x.replace("_", ""))#nok valeurs = '_'
df['Num_of_Loan'] = df['Num_of_Loan'].apply(lambda x: x.replace("-", ""))
df['Num_of_Loan'].unique()

array(['4', '1', '3', '100', '2', '5', '6', '8', '7', '9', '965', '50',
       '495', '1018', '1470', '481', '617', '1237', '602', '582', '1225',
       '1146', '505', '463', '864', '949', '720', '181', '1048', '814',
       '434', '77', '639', '336', '249', '106', '1259', '1365', '114',
       '810', '992', '1416', '1374', '746', '1487', '1147', '511', '198',
       '1140', '876', '569', '1221', '1040', '1496', '1063', '1428',
       '1361', '232', '653', '1448', '426', '1068', '486', '1027', '1108',
       '1471', '628', '1284', '1446', '35', '483', '928', '1300', '547',
       '950', '1153', '539', '1240', '376', '1481', '1287', '325', '72',
       '1024', '220', '478', '551', '1244', '140', '1329', '255', '326',
       '1149', '641', '97', '295', '790', '624', '659', '361', '813',
       '1095', '508', '879', '1373', '1445', '612', '324', '531', '339',
       '1057', '343', '395', '1175', '663', '135', '1447', '354', '477',
       '544', '204', '1369', '534', '1292', '1436', '939'], dtype=object)

In [181]:
df['Type_of_Loan'] #ok, String

0        Auto Loan, Credit-Builder Loan, Personal Loan,...
1        Auto Loan, Credit-Builder Loan, Personal Loan,...
7                                      Credit-Builder Loan
9                  Auto Loan, Auto Loan, and Not Specified
12                                           Not Specified
                               ...
49991    Home Equity Loan, Mortgage Loan, and Student Loan
49992    Personal Loan, Auto Loan, Mortgage Loan, Stude...
49993    Personal Loan, Auto Loan, Mortgage Loan, Stude...
49997                          Auto Loan, and Student Loan
49999                          Auto Loan, and Student Loan
Name: Type_of_Loan, Length: 22496, dtype: object

In [182]:
df = df[df['Delay_from_due_date'] > 0]  #negative values, could be? 
df['Delay_from_due_date'].unique()

array([ 3,  6,  5, 30, 11,  2, 16,  4, 10,  8,  9, 51, 45, 48, 25, 43, 22,
       49, 55, 52, 61, 59, 31, 27, 18, 15, 53, 14, 12, 17,  7, 50, 44, 13,
       34, 20, 28, 23, 57, 62, 24, 56, 41, 37, 19,  1, 64, 36, 42, 60, 21,
       33, 26, 38, 29, 32, 35, 40, 54, 47, 46, 39, 66, 58, 65, 67, 63],
      dtype=int64)

In [183]:

#Un délai négatif pourrait signifier que la date de paiement a été dépassé sans paiement
#dans Num_of_Delayed_payment il s’agit probablement d’erreurs

df['Num_of_Delayed_Payment'] = df['Num_of_Delayed_Payment'].apply(lambda x: x.replace("_", ""))
df['Num_of_Delayed_Payment'] = df['Num_of_Delayed_Payment'].apply(lambda x: x.replace("-", ""))
df['Num_of_Delayed_Payment'].unique() #negative values, underscore values

array(['7', '9', '2', '3', '6', '8', '14', '12', '0', '19', '20', '10',
       '15', '1150', '18', '23', '21', '17', '22', '11', '13', '5', '16',
       '4', '25', '24', '429', '1', '2806', '4246', '75', '1134', '27',
       '26', '1230', '4318', '28', '1216', '3667', '420', '2606', '1122',
       '3178', '3398', '1486', '586', '873', '2801', '2503', '3954',
       '376', '2354', '4343', '2279', '391', '1334', '1958', '2608',
       '1274', '452', '227', '2161', '377', '1544', '975', '211', '518',
       '657', '3477', '370', '1534', '1080', '3057', '2819', '1329',
       '3684', '1802', '1880', '181', '3591', '1356', '2672', '2001',
       '4298', '590', '1095', '1562', '100', '2276', '2822', '832',
       '3529', '2942', '2802', '3393', '288', '2424', '345', '2269',
       '179', '1513', '3071', '700', '2836', '434', '2649', '1891',
       '2999', '2344', '1437', '1633', '2431', '864', '1297', '414',
       '4044', '427', '952', '1571', '3863', '1832', '3425', '1959',
       '1990', '1166', '3565', '2595', '2873', '2286', '2018', '3589',
       '292', '2767', '1246', '652', '3744', '3229', '3520', '707',
       '2392', '817', '806', '3161', '2902', '4088', '1149', '1312',
       '2055', '861', '3803', '3064', '1761', '4133', '3392', '358',
       '2368', '2570', '3032', '828', '238', '3807', '1169', '1703',
       '2287', '688', '4214', '4026', '726', '3099', '2748', '2704',
       '3535', '1055', '1265', '3630', '1290', '1833', '459', '2170',
       '2407', '4270', '3608', '1289', '2953', '3757', '2052', '4141',
       '883', '2410', '989', '3920', '1634', '481', '97', '2346', '4313',
       '3622', '1779', '1619', '3406', '3594', '272', '3637', '174',
       '2450', '3913', '332', '2034'], dtype=object)

In [189]:

df['Changed_Credit_Limit'] = df['Changed_Credit_Limit'].apply(lambda x: x.replace("_", "0"))
df['Changed_Credit_Limit'] = df['Changed_Credit_Limit'].astype(float)

df['Changed_Credit_Limit'].unique() #nok object should be Float

array([11.27, 13.27,  7.42, ...,  7.95, 25.16, 13.39])

In [190]:
df['Num_Credit_Inquiries'] #ok Float

0        2022.0
1           4.0
7           5.0
9           3.0
12          4.0
          ...
49991       3.0
49992       9.0
49993      12.0
49997       7.0
49999       7.0
Name: Num_Credit_Inquiries, Length: 22132, dtype: float64

In [193]:
df['Credit_Mix'] = df['Credit_Mix'].apply(lambda x: x.replace("_", "Standard"))
df['Credit_Mix'].unique() #nok '_'

array(['Good', 'Standard', 'Bad'], dtype=object)

In [195]:
df['Outstanding_Debt'] = df['Outstanding_Debt'].apply(lambda x: x.replace("_", "")) #nok object should be Float
df['Outstanding_Debt'] = df['Outstanding_Debt'].astype(float)
df['Outstanding_Debt'].unique()

array([ 809.98,  605.03, 1303.01, ...,  620.64, 3571.7 ,  502.38])

In [91]:
df['Credit_Utilization_Ratio'] #ok Float

0        35.030402
1        33.053114
4        25.926822
5        30.116600
7        33.875167
           ...
49992    32.391288
49993    37.528511
49994    27.027812
49997    36.858542
49999    34.108530
Name: Credit_Utilization_Ratio, Length: 26459, dtype: float64

In [206]:
#df['Credit_History_Age']

df['Credit_History_Age_Years'] = df['Credit_History_Age'].apply(lambda date: date.split(' ')[0])
df['Credit_History_Age_Months'] = df['Credit_History_Age'].apply(lambda date: date.split(' ')[3])
df['Credit_History_Age_Months'] = df['Credit_History_Age_Months'].astype(int)
df['Credit_History_Age_Years'] = df['Credit_History_Age_Years'].astype(int)
df=df.drop(['Credit_History_Age'], axis=1)

#df['Credit_History_Age_Years'].unique()
#df['Credit_History_Age_Months'].unique()

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_History_Age_Years,Credit_History_Age_Months
0,0x160a,CUS_0xd40,September,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,Good,809.98,35.030402,No,49.574949,236.64268203272135,Low_spent_Small_value_payments,186.26670208571772,22,9
1,0x160b,CUS_0xd40,October,Aaron Maashoh,24,821-00-0265,Scientist,19114.12,1824.843333,3,...,Good,809.98,33.053114,No,49.574949,21.465380264657146,High_spent_Medium_value_payments,361.44400385378196,22,10

In [208]:
df['Payment_of_Min_Amount'] = df['Payment_of_Min_Amount'].apply(lambda x: x.replace('NM', 'No'))#nok need to trasforme'NM'-->'No'
df['Payment_of_Min_Amount'].unique()

array(['No', 'Yes'], dtype=object)

In [95]:
df['Total_EMI_per_month'] #ok Float

0        49.574949
1        49.574949
4        18.816215
5        18.816215
7        18.816215
           ...
49992    60.964772
49993    60.964772
49994    60.964772
49997    35.104023
49999    35.104023
Name: Total_EMI_per_month, Length: 26459, dtype: float64

In [210]:
df['Amount_invested_monthly'] = df['Amount_invested_monthly'].apply(lambda x: x.replace("_", ""))
df['Amount_invested_monthly'] = df['Amount_invested_monthly'].astype(float) #nok trasforme '236.64268203272135' -> 236.64268203272135
df['Amount_invested_monthly'].unique()

array([236.64268203,  21.46538026, 153.53448761, ..., 107.21074165,
        71.79442083, 220.45787812])

In [211]:
df['Payment_Behaviour'] = df['Payment_Behaviour'].apply(lambda x: x.replace('!@9#%8', df['Payment_Behaviour'].mode()[0])) #nok '!@9#%8'
df['Payment_Behaviour'].unique()

array(['Low_spent_Small_value_payments',
       'High_spent_Medium_value_payments',
       'Low_spent_Large_value_payments',
       'High_spent_Large_value_payments',
       'Low_spent_Medium_value_payments',
       'High_spent_Small_value_payments'], dtype=object)

In [213]:
df['Monthly_Balance'] = df['Monthly_Balance'].apply(lambda x: x.replace("_", ""))
df['Monthly_Balance'] = df['Monthly_Balance'].astype(float)  #nok trasforme '236.64268203272135' -> 236.64268203272135
df['Monthly_Balance'].unique()

array([186.26670209, 361.44400385, 421.44796448, ..., 350.23147346,
       349.7263321 , 360.3796826 ])

In [215]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22132 entries, 0 to 49999
Data columns (total 28 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   ID                         22132 non-null  object
 1   Customer_ID                22132 non-null  object
 2   Month                      22132 non-null  object
 3   Name                       22132 non-null  object
 4   Age                        22132 non-null  int32
 5   SSN                        22132 non-null  object
 6   Occupation                 22132 non-null  object
 7   Annual_Income              22132 non-null  float64
 8   Monthly_Inhand_Salary      22132 non-null  float64
 9   Num_Bank_Accounts          22132 non-null  int64
 10  Num_Credit_Card            22132 non-null  int64
 11  Interest_Rate              22132 non-null  int64
 12  Num_of_Loan                22132 non-null  object
 13  Type_of_Loan               22132 non-null  object
 14  Delay_from_due_date        22132 non-null  int64
 15  Num_of_Delayed_Payment     22132 non-null  object
 16  Changed_Credit_Limit       22132 non-null  float64
 17  Num_Credit_Inquiries       22132 non-null  float64
 18  Credit_Mix                 22132 non-null  object
 19  Outstanding_Debt           22132 non-null  float64
 20  Credit_Utilization_Ratio   22132 non-null  float64
 21  Payment_of_Min_Amount      22132 non-null  object
 22  Total_EMI_per_month        22132 non-null  float64
 23  Amount_invested_monthly    22132 non-null  float64
 24  Payment_Behaviour          22132 non-null  object
 25  Monthly_Balance            22132 non-null  float64
 26  Credit_History_Age_Years   22132 non-null  int32
 27  Credit_History_Age_Months  22132 non-null  int32
dtypes: float64(9), int32(3), int64(4), object(12)
memory usage: 4.6+ MB